; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v4 ?v6)
		(pred_4 ?v8)
		(pred_5 ?v5)
		(pred_1 ?v5)
		(pred_3 ?v8 ?v5)
		(pred_2)
		(pred_6 ?v8))

   (:action op_3
       :parameters  (?v2 ?v3)
       :precondition (and (not-eq ?v2 ?v3) 
                          (pred_5 ?v2) (pred_5 ?v3) (pred_1 ?v2))
       :effect (and  (pred_1 ?v3)
		     (not (pred_1 ?v2))))


   (:action op_2
       :parameters (?v1 ?v7)
       :precondition  (and  (pred_4 ?v1) (pred_5 ?v7)
			    (pred_3 ?v1 ?v7) (pred_1 ?v7) (pred_2))
       :effect (and (pred_6 ?v1)
		    (not (pred_3 ?v1 ?v7)) 
		    (not (pred_2))))

   (:action op_1
       :parameters  (?v1  ?v7)
       :precondition  (and  (pred_4 ?v1) (pred_5 ?v7)
			    (pred_6 ?v1) (pred_1 ?v7))
       :effect (and (pred_3 ?v1 ?v7)
		    (pred_2)
		    (not (pred_6 ?v1)))))

; problem
(define (problem ferry-l4-c3)
(:domain ferry)
(:objects obj_02 obj_05 obj_01 obj_04 
          obj_06 obj_07 obj_03 
)
(:init
(pred_5 obj_02)
(pred_5 obj_05)
(pred_5 obj_01)
(pred_5 obj_04)
(pred_4 obj_06)
(pred_4 obj_07)
(pred_4 obj_03)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_01)
(not-eq obj_01 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_05 obj_01)
(not-eq obj_01 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_05)
(not-eq obj_01 obj_04)
(not-eq obj_04 obj_01)
(pred_2)
(pred_3 obj_06 obj_05)
(pred_3 obj_07 obj_05)
(pred_3 obj_03 obj_02)
(pred_1 obj_04)
)
(:goal
(and
(pred_3 obj_06 obj_05)
(pred_3 obj_07 obj_04)
(pred_3 obj_03 obj_05)
)
)

(:constraints
  (and
    (sometime-before  (pred_3 obj_07 obj_04) (pred_1 obj_02))
    (sometime-before  (pred_3 obj_03 obj_05) (pred_1 obj_01))
  )
)
)

; plan
1. (op_3 obj_04 obj_05)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_05)
   goals met: 1 of 3
2. (op_2 obj_07 obj_05)
   deleted: (pred_3 obj_07 obj_05) (pred_2)
   added: (pred_6 obj_07)
   goals met: 1 of 3
3. (op_3 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_01)
   goals met: 1 of 3
4. (op_1 obj_07 obj_01)
   deleted: (pred_6 obj_07)
   added: (pred_3 obj_07 obj_01) (pred_2)
   goals met: 1 of 3
5. (op_3 obj_01 obj_02)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_02)
   goals met: 1 of 3
6. (op_2 obj_03 obj_02)
   deleted: (pred_3 obj_03 obj_02) (pred_2)
   added: (pred_6 obj_03)
   goals met: 1 of 3
7. (op_3 obj_02 obj_05)
   deleted: (pred_1 obj_02)
   added: (pred_1 obj_05)
   goals met: 1 of 3
8. (op_1 obj_03 obj_05)
   deleted: (pred_6 obj_03)
   added: (pred_3 obj_03 obj_05) (pred_2)
   goals met: 2 of 3
9. (op_3 obj_05 obj_01)
   deleted: (pred_1 obj_05)
   added: (pred_1 obj_01)
   goals met: 2 of 3
10. (op_2 obj_07 obj_01)
   deleted: (pred_3 obj_07 obj_01) (pred_2)
   added: (pred_6 obj_07)
   goals met: 2 of 3
11. (op_3 obj_01 obj_04)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_04)
   goals met: 2 of 3
12. (op_1 obj_07 obj_04)
   deleted: (pred_6 obj_07)
   added: (pred_3 obj_07 obj_04) (pred_2)
   goals met: 3 of 3
